# Pandas

In [1]:
import pandas as pd

In [2]:
pwd

'H:\\Udemy Courses\\[FreeTutorials.Us] Udemy - complete-guide-to-tensorflow-for-deep-learning-with-python\\01 Introduction\\003 FULL-TENSORFLOW-NOTES-AND-DATA\\Tensorflow-Bootcamp-master'

In [3]:
ls

 Volume in drive H is Media
 Volume Serial Number is 303A-A383

 Directory of H:\Udemy Courses\[FreeTutorials.Us] Udemy - complete-guide-to-tensorflow-for-deep-learning-with-python\01 Introduction\003 FULL-TENSORFLOW-NOTES-AND-DATA\Tensorflow-Bootcamp-master

23-12-2019  10:56 PM    <DIR>          .
23-12-2019  10:56 PM    <DIR>          ..
23-12-2019  10:54 PM    <DIR>          .ipynb_checkpoints
05-11-2017  12:33 AM    <DIR>          00-Crash-Course-Basics
05-11-2017  12:33 AM    <DIR>          01-Neural-Network-Basics
05-11-2017  12:33 AM    <DIR>          02-TensorFlow-Basics
05-11-2017  12:33 AM    <DIR>          03-Convolutional-Neural-Networks
05-11-2017  12:33 AM    <DIR>          04-Recurrent-Neural-Networks
05-11-2017  12:33 AM    <DIR>          05-Autoencoders
05-11-2017  12:33 AM    <DIR>          06-Generative-Adversarial-Networks
05-11-2017  12:33 AM    <DIR>          07-Reinforcement-Learning-OpenAI
05-11-2017  12:33 AM           192,512 db.sqlite3
05-11-2017  12:33 AM             1,808 linux_mac_tfdl_env.yml
05-11-2017  12:33 AM    <DIR>          Miscellaneous-Topics
23-12-2019  10:56 PM               710 Pandas.ipynb
05-11-2017  12:33 AM                25 README.md
21-12-2019  08:47 PM             1,948 tfdl_env.yml
23-12-2019  10:53 PM            12,262 using numpy.ipynb
               6 File(s)        209,265 bytes
              12 Dir(s)  156,577,759,232 bytes free

In [5]:
cd 00-Crash-Course-Basics/

[WinError 2] The system cannot find the file specified: '00-Crash-Course-Basics/'
H:\Udemy Courses\[FreeTutorials.Us] Udemy - complete-guide-to-tensorflow-for-deep-learning-with-python\01 Introduction\003 FULL-TENSORFLOW-NOTES-AND-DATA\Tensorflow-Bootcamp-master\00-Crash-Course-Basics

In [6]:
ls

 Volume in drive H is Media
 Volume Serial Number is 303A-A383

 Directory of H:\Udemy Courses\[FreeTutorials.Us] Udemy - complete-guide-to-tensorflow-for-deep-learning-with-python\01 Introduction\003 FULL-TENSORFLOW-NOTES-AND-DATA\Tensorflow-Bootcamp-master\00-Crash-Course-Basics

05-11-2017  12:33 AM    <DIR>          .
05-11-2017  12:33 AM    <DIR>          ..
05-11-2017  12:33 AM    <DIR>          .ipynb_checkpoints
05-11-2017  12:33 AM            13,228 00-NumPy-Crash-Course-Overview.ipynb
05-11-2017  12:33 AM             9,565 01-Pandas-Crash-Course.ipynb
05-11-2017  12:33 AM            80,405 02-Data-Viz-Crash-Course.ipynb
05-11-2017  12:33 AM             9,271 03-SciKit-Learn-Overview.ipynb
05-11-2017  12:33 AM            58,045 05-Crash-Course-Review-Exercises.ipynb
05-11-2017  12:33 AM            58,894 05-Crash-Course-Review-Exercises-Solutions.ipynb
05-11-2017  12:33 AM                61 salaries.csv
               7 File(s)        229,469 bytes
               3 Dir(s)  156,577,759,232 bytes free

In [7]:
df = pd.read_csv('salaries.csv')

In [8]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [13]:
df['Age']

0    34
1    45
2    27
Name: Age, dtype: int64

In [16]:
df[['Name','Salary']]

     Name  Salary
0    John   50000
1   Sally  120000
2  Alyssa   80000

In [17]:
df['Salary'].max()

120000

In [19]:
df.describe()

              Salary        Age
count       3.000000   3.000000
mean    83333.333333  35.333333
std     35118.845843   9.073772
min     50000.000000  27.000000
25%     65000.000000  30.500000
50%     80000.000000  34.000000
75%    100000.000000  39.500000
max    120000.000000  45.000000

In [20]:
df['Salary'] > 50000

0    False
1     True
2     True
Name: Salary, dtype: bool

In [21]:
my_filter = df['Salary'] >50000

In [22]:
df[my_filter]

     Name  Salary  Age
1   Sally  120000   45
2  Alyssa   80000   27

In [23]:
df[df['Salary'] > 50000]

     Name  Salary  Age
1   Sally  120000   45
2  Alyssa   80000   27

In [32]:
df.as_matrix()

h:\pythoninstalledfiles\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.
  """Entry point for launching an IPython kernel.

array([['John', 50000, 34],
       ['Sally', 120000, 45],
       ['Alyssa', 80000, 27]], dtype=object)